/*--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+--*/
/*  System Name   : INSECT POKEMON                                           */
/*  Machine & OS  : Sony PlayStation / PlayStation OS ( R3000 )              */
/*  Language      : GNU C                                                    */
/*                                                                           */
/*  File Contents : GRAPHICS AREA PUBLIC                                     */
/*  File Attribute: SOURCE                                                   */
/*  File Name     : PUBGRP.C                                                 */
/*                                                                           */
/*--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+--*/

/*----- User Header     Files -----*/
#include "../lib/grpara.h"

/*--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+--*/
/*  ORDERING TABLE                                                           */
/*--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+--*/
GsOT                            ot[2];    /* Ordering Table                  */
GsOT_TAG      ot_tag[2][1<<OT_LENGTH];    /* オーダリングテーブル実体        */

/*--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+--*/
/*  GPU PACKET                                                               */
/*--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+--*/
PACKET        packet[2][PACKETMAX*24];    /* GPU Packet Buffer               */

/*--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+--*/
/*  BACK COLOR                                                               */
/*--+----1----+----2----+----3----+----4----+----5----+----6----+----7----+--*/
unsigned char bg_col[3];                /* CLEAR COLOR / BACK COLOR / FOG(FAR) COLOR etc */

